package com.deep.chalisasangrah;

import android.graphics.Typeface;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.text.method.ScrollingMovementMethod;
import android.widget.TextView;

public class Main2Activity extends AppCompatActivity {

    TextView txt;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main2);
        txt = (TextView)findViewById(R.id.textView);

        Typeface myfont =  Typeface.createFromAsset(getAssets(),"fonts/Kruti_Dev_100__Bold.ttf");
        txt.setTypeface(myfont);
        txt.setMovementMethod(new ScrollingMovementMethod());

        txtLoader();


    }
     public void txtLoader(){



         String s = "श्री हनुमान चालीसा\n" +"\n"  +"॥दोहा॥\n" +
                 "\n" +
                 "श्रीगुरु चरन सरोज रज निज मनु मुकुरु सुधारि ।\n" +
                 "बरनउँ रघुबर बिमल जसु जो दायकु फल चारि ॥\n" +
                 "\n" +
                 "बुद्धिहीन तनु जानिके सुमिरौं पवन-कुमार ।\n" +
                 "बल बुधि बिद्या देहु मोहिं हरहु कलेस बिकार ॥\n" +
                 "\n" +
                 "॥चौपाई॥\n" +
                 "\n" +
                 "जय हनुमान ज्ञान गुन सागर ।\n" +
                 "जय कपीस तिहुँ लोक उजागर ॥१॥\n" +
                 "\n" +
                 "राम दूत अतुलित बल धामा ।\n" +
                 "अञ्जनि-पुत्र पवनसुत नामा ॥२॥\n" +
                 "\n" +
                 "महाबीर बिक्रम बजरङ्गी ।\n" +
                 "कुमति निवार सुमति के सङ्गी ॥३॥\n" +
                 "\n" +
                 "कञ्चन बरन बिराज सुबेसा ।\n" +
                 "कानन कुण्डल कुञ्चित केसा ॥४॥\n" +
                 "\n" +
                 "हाथ बज्र औ ध्वजा बिराजै ।\n" +
                 "काँधे मूँज जनेउ साजै ॥५॥\n" +
                 "\n" +
                 "सङ्कर सुवन केसरीनन्दन ।\n" +
                 "तेज प्रताप महा जग बन्दन ॥६॥\n" +
                 "\n" +
                 "बिद्यावान गुनी अति चातुर ।\n" +
                 "राम काज करिबे को आतुर ॥७॥\n" +
                 "\n" +
                 "प्रभु चरित्र सुनिबे को रसिया ।\n" +
                 "राम लखन सीता मन बसिया ॥८॥\n" +
                 "\n" +
                 "सूक्ष्म रूप धरि सियहिं दिखावा ।\n" +
                 "बिकट रूप धरि लङ्क जरावा ॥९॥\n" +
                 "\n" +
                 "भीम रूप धरि असुर सँहारे ।\n" +
                 "रामचन्द्र के काज सँवारे ॥१०॥\n" +
                 "\n" +
                 "लाय सञ्जीवन लखन जियाये ।\n" +
                 "श्रीरघुबीर हरषि उर लाये ॥११॥\n" +
                 "\n" +
                 "रघुपति कीह्नी बहुत बड़ाई ।\n" +
                 "तुम मम प्रिय भरतहि सम भाई ॥१२॥\n" +
                 "\n" +
                 "सहस बदन तुह्मारो जस गावैं ।\n" +
                 "अस कहि श्रीपति कण्ठ लगावैं ॥१३॥\n" +
                 "\n" +
                 "सनकादिक ब्रह्मादि मुनीसा ।\n" +
                 "नारद सारद सहित अहीसा ॥१४॥\n" +
                 "\n" +
                 "जम कुबेर दिगपाल जहाँ ते ।\n" +
                 "कबि कोबिद कहि सके कहाँ ते ॥१५॥\n" +
                 "\n" +
                 "तुम उपकार सुग्रीवहिं कीह्ना ।\n" +
                 "राम मिलाय राज पद दीह्ना ॥१६॥\n" +
                 "\n" +
                 "तुह्मरो मन्त्र बिभीषन माना ।\n" +
                 "लङ्केस्वर भए सब जग जाना ॥१७॥\n" +
                 "\n" +
                 "जुग सहस्र जोजन पर भानु ।\n" +
                 "लील्यो ताहि मधुर फल जानू ॥१८॥\n" +
                 "\n" +
                 "प्रभु मुद्रिका मेलि मुख माहीं ।\n" +
                 "जलधि लाँघि गये अचरज नाहीं ॥१९॥\n" +
                 "\n" +
                 "दुर्गम काज जगत के जेते ।\n" +
                 "सुगम अनुग्रह तुह्मरे तेते ॥२०॥\n" +
                 "\n" +
                 "राम दुआरे तुम रखवारे ।\n" +
                 "होत न आज्ञा बिनु पैसारे ॥२१॥\n" +
                 "\n" +
                 "सब सुख लहै तुह्मारी सरना ।\n" +
                 "तुम रच्छक काहू को डर ना ॥२२॥\n" +
                 "\n" +
                 "आपन तेज सह्मारो आपै ।\n" +
                 "तीनों लोक हाँक तें काँपै ॥२३॥\n" +
                 "\n" +
                 "भूत पिसाच निकट नहिं आवै ।\n" +
                 "महाबीर जब नाम सुनावै ॥२४॥\n" +
                 "\n" +
                 "नासै रोग हरै सब पीरा ।\n" +
                 "जपत निरन्तर हनुमत बीरा ॥२५॥\n" +
                 "\n" +
                 "सङ्कट तें हनुमान छुड़ावै ।\n" +
                 "मन क्रम बचन ध्यान जो लावै ॥२६॥\n" +
                 "\n" +
                 "सब पर राम तपस्वी राजा ।\n" +
                 "तिन के काज सकल तुम साजा ॥२७॥\n" +
                 "\n" +
                 "और मनोरथ जो कोई लावै ।\n" +
                 "सोई अमित जीवन फल पावै ॥२८॥\n" +
                 "\n" +
                 "चारों जुग परताप तुह्मारा ।\n" +
                 "है परसिद्ध जगत उजियारा ॥२९॥\n" +
                 "\n" +
                 "साधु सन्त के तुम रखवारे ।\n" +
                 "असुर निकन्दन राम दुलारे ॥३०॥\n" +
                 "\n" +
                 "अष्टसिद्धि नौ निधि के दाता ।\n" +
                 "अस बर दीन जानकी माता ॥३१॥\n" +
                 "\n" +
                 "राम रसायन तुह्मरे पासा ।\n" +
                 "सदा रहो रघुपति के दासा ॥३२॥\n" +
                 "\n" +
                 "तुह्मरे भजन राम को पावै ।\n" +
                 "जनम जनम के दुख बिसरावै ॥३३॥\n" +
                 "\n" +
                 "अन्त काल रघुबर पुर जाई ।\n" +
                 "जहाँ जन्म हरिभक्त कहाई ॥३४॥\n" +
                 "\n" +
                 "और देवता चित्त न धरई ।\n" +
                 "हनुमत सेइ सर्ब सुख करई ॥३५॥\n" +
                 "\n" +
                 "सङ्कट कटै मिटै सब पीरा ।\n" +
                 "जो सुमिरै हनुमत बलबीरा ॥३६॥\n" +
                 "\n" +
                 "जय जय जय हनुमान गोसाईं ।\n" +
                 "कृपा करहु गुरुदेव की नाईं ॥३७॥\n" +
                 "\n" +
                 "जो सत बार पाठ कर कोई ।\n" +
                 "छूटहि बन्दि महा सुख होई ॥३८॥\n" +
                 "\n" +
                 "जो यह पढ़ै हनुमान चालीसा ।\n" +
                 "होय सिद्धि साखी गौरीसा ॥३९॥\n" +
                 "\n" +
                 "तुलसीदास सदा हरि चेरा ।\n" +
                 "कीजै नाथ हृदय महँ डेरा ॥४०॥\n" +
                 "\n" +
                 "॥दोहा॥\n" +
                 "\n" +
                 "पवनतनय सङ्कट हरन मङ्गल मूरति रूप ।\n" +
                 "राम लखन सीता सहित हृदय बसहु सुर भूप ॥";




         txt.setText(s);
     }

}
