package com.deep.chalisasangrah;

import android.graphics.Typeface;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.text.method.ScrollingMovementMethod;
import android.widget.TextView;

public class Main4Activity extends AppCompatActivity {
      TextView txt;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main4);
        txt = (TextView)findViewById(R.id.textView3);

        Typeface myfont =  Typeface.createFromAsset(getAssets(),"fonts/Kruti_Dev_100__Bold.ttf");
        txt.setTypeface(myfont);
        txt.setMovementMethod(new ScrollingMovementMethod());

        txtLoader();


    }
    public void txtLoader(){


        String  s = "श्री सरस्वती चालीसा \n" +
                "\n" +
                "॥दोहा॥\n" +
                "\n" +
                "जनक जननि पद्मरज, निज मस्तक पर धरि।\n" +
                "बन्दौं मातु सरस्वती, बुद्धि बल दे दातारि॥\n" +
                "पूर्ण जगत में व्याप्त तव, महिमा अमित अनंतु।\n" +
                "दुष्जनों के पाप को, मातु तु ही अब हन्तु॥\n" +
                "\n" +
                "॥चालीसा॥\n" +
                "\n" +
                "जय श्री सकल बुद्धि बलरासी।जय सर्वज्ञ अमर अविनाशी॥\n" +
                "जय जय जय वीणाकर धारी।करती सदा सुहंस सवारी॥1\n" +
                "\n" +
                "रूप चतुर्भुज धारी माता।सकल विश्व अन्दर विख्याता॥\n" +
                "जग में पाप बुद्धि जब होती।तब ही धर्म की फीकी ज्योति॥2\n" +
                "\n" +
                "तब ही मातु का निज अवतारी।पाप हीन करती महतारी॥\n" +
                "वाल्मीकिजी थे हत्यारा।तव प्रसाद जानै संसारा॥3\n" +
                "\n" +
                "रामचरित जो रचे बनाई।आदि कवि की पदवी पाई॥\n" +
                "कालिदास जो भये विख्याता।तेरी कृपा दृष्टि से माता॥4\n" +
                "\n" +
                "तुलसी सूर आदि विद्वाना।भये और जो ज्ञानी नाना॥\n" +
                "तिन्ह न और रहेउ अवलम्बा।केव कृपा आपकी अम्बा॥5\n" +
                "\n" +
                "करहु कृपा सोइ मातु भवानी।दुखित दीन निज दासहि जानी॥\n" +
                "पुत्र करहिं अपराध बहूता।तेहि न धरई चित माता॥6\n" +
                "\n" +
                "राखु लाज जननि अब मेरी।विनय करउं भांति बहु तेरी॥\n" +
                "मैं अनाथ तेरी अवलंबा।कृपा करउ जय जय जगदंबा॥7\n" +
                "\n" +
                "मधुकैटभ जो अति बलवाना।बाहुयुद्ध विष्णु से ठाना॥\n" +
                "समर हजार पाँच में घोरा।फिर भी मुख उनसे नहीं मोरा॥8\n" +
                "\n" +
                "मातु सहाय कीन्ह तेहि काला।बुद्धि विपरीत भई खलहाला॥\n" +
                "तेहि ते मृत्यु भई खल केरी।पुरवहु मातु मनोरथ मेरी॥9\n" +
                "\n" +
                "चंड मुण्ड जो थे विख्याता।क्षण महु संहारे उन माता॥\n" +
                "रक्त बीज से समरथ पापी।सुरमुनि हदय धरा सब काँपी॥10\n" +
                "\n" +
                "काटेउ सिर जिमि कदली खम्बा।बारबार बिन वउं जगदंबा॥\n" +
                "जगप्रसिद्ध जो शुंभनिशुंभा।क्षण में बाँधे ताहि तू अम्बा॥11\n" +
                "\n" +
                "भरतमातु बुद्धि फेरेऊ जाई।रामचन्द्र बनवास कराई॥\n" +
                "एहिविधि रावण वध तू कीन्हा।सुर नरमुनि सबको सुख दीन्हा॥12\n" +
                "\n" +
                "को समरथ तव यश गुन गाना।निगम अनादि अनंत बखाना॥\n" +
                "विष्णु रुद्र जस कहिन मारी।जिनकी हो तुम रक्षाकारी॥13\n" +
                "\n" +
                "रक्त दन्तिका और शताक्षी।नाम अपार है दानव भक्षी॥\n" +
                "दुर्गम काज धरा पर कीन्हा।दुर्गा नाम सकल जग लीन्हा॥14\n" +
                "\n" +
                "दुर्ग आदि हरनी तू माता।कृपा करहु जब जब सुखदाता॥\n" +
                "नृप कोपित को मारन चाहे।कानन में घेरे मृग नाहे॥15\n" +
                "\n" +
                "सागर मध्य पोत के भंजे।अति तूफान नहिं कोऊ संगे॥\n" +
                "भूत प्रेत बाधा या दुःख में।हो दरिद्र अथवा संकट में॥16\n" +
                "\n" +
                "नाम जपे मंगल सब होई।संशय इसमें करई न कोई॥\n" +
                "पुत्रहीन जो आतुर भाई।सबै छांड़ि पूजें एहि भाई॥17\n" +
                "\n" +
                "करै पाठ नित यह चालीसा।होय पुत्र सुन्दर गुण ईशा॥\n" +
                "धूपादिक नैवेद्य चढ़ावै।संकट रहित अवश्य हो जावै॥18\n" +
                "\n" +
                "भक्ति मातु की करैं हमेशा। निकट न आवै ताहि कलेशा॥\n" +
                "बंदी पाठ करें सत बारा। बंदी पाश दूर हो सारा॥19\n" +
                "\n" +
                "रामसागर बाँधि हेतु भवानी।कीजै कृपा दास निज जानी।20\n" +
                "\n" +
                "॥दोहा॥\n" +
                "\n" +
                "मातु सूर्य कान्ति तव, अन्धकार मम रूप।\n" +
                "डूबन से रक्षा करहु परूँ न मैं भव कूप॥\n" +
                "बलबुद्धि विद्या देहु मोहि, सुनहु सरस्वती मातु।\n" +
                "राम सागर अधम को आश्रय तू ही देदातु॥\n" +
                "\n";

        txt.setText(s);

    }
}
