package com.deep.chalisasangrah;

import android.graphics.Typeface;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.text.method.ScrollingMovementMethod;
import android.widget.TextView;

public class Main5Activity extends AppCompatActivity {
    TextView txt;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main5);
        txt = (TextView)findViewById(R.id.textView4);

        Typeface myfont =  Typeface.createFromAsset(getAssets(),"fonts/Kruti_Dev_100__Bold.ttf");
        txt.setTypeface(myfont);
        txt.setMovementMethod(new ScrollingMovementMethod());

        txtLoader();


    }
    public void txtLoader(){

        String s = "श्री साँई चालीसा \n" +
                "\n" +
                "\n" +
                "श्री साँई के चरणों में, अपना शीश नवाऊं मैंकैसे शिरडी साँई आए, सारा हाल सुनाऊ मैं\n" +
                "कौन है माता, पिता कौन है, यह न किसी ने भी जाना।\n" +
                "कहां जन्म साँई ने धारा, प्रश्न पहेली रहा बना\n" +
                "कोई कहे अयोध्या के, ये रामचन्द्र भगवान हैं।\n" +
                "कोई कहता साँई बाबा, पवन-पुत्र हनुमान हैं\n" +
                "कोई कहता मंगल मूर्ति, श्री गजानन हैं साँई।\n" +
                "\n" +
                "कोई कहता गोकुल-मोहन, देवकी नन्द्न हैं साँई\n" +
                "शंकर समझ भक्त कई तो, बाबा को भजते रहते।\n" +
                "कोई कह अवतार दत्त का, पूजा साँई की करते\n" +
                "कुछ भी मानो उनको तुम, पर साँई हैं सच्चे भगवान।\n" +
                "बड़े दयालु, दीनबन्धु, कितनों को दिया जीवनदान\n" +
                "कई बरस पहले की घटना, तुम्हें सुनाऊंगा मैं बात।\n" +
                "\n" +
                "किसी भाग्यशाली की शिरडी में, आई थी बारात\n" +
                "आया साथ उसी के था, बालक एक बहुत सुनदर।\n" +
                "आया, आकर वहीं बद गया, पावन शिरडी किया नगर\n" +
                "कई दिनों तक रहा भटकता, भिक्षा मांगी उसने दर-दर।\n" +
                "और दिखाई ऎसी लीला, जग में जो हो गई अमर\n" +
                "जैसे-जैसे उमर बढ़ी, बढ़ती ही वैसे गई शान।\n" +
                "\n" +
                "घर-घर होने लगा नगर में, साँई बाबा का गुणगान\n" +
                "दिगदिगन्त में लगा गूंजने, फिर तो साँई जी का नाम।\n" +
                "दीन मुखी की रक्षा करना, यही रहा बाबा का काम\n" +
                "बाबा के चरणों जाकर, जो कहता मैं हूं निर्धन।\n" +
                "दया उसी पर होती उनकी, खुल जाते द:ख के बंधन\n" +
                "कभी किसी ने मांगी भिक्षा, दो बाबा मुझ को संतान।\n" +
                "\n" +
                "एवं अस्तु तब कहकर साँई, देते थे उसको वरदान\n" +
                "स्वयं दु:खी बाबा हो जाते, दीन-दुखी जन का लख हाल।\n" +
                "अंत:करन भी साँई का, सागर जैसा रहा विशाल\n" +
                "भक्त एक मद्रासी आया, घर का बहुत बड़ा धनवान।\n" +
                "माल खजाना बेहद उसका, केवल नहीं रही संतान\n" +
                "लगा मनाने साँईनाथ को, बाबा मुझ पर दया करो।\n" +
                "\n" +
                "झंझा से झंकृत नैया को, तुम ही मेरी पार करो\n" +
                "कुलदीपक के अभाव में, व्यर्थ है दौलत की माया।\n" +
                "आज भिखारी बनकर बाबा, शरण तुम्हारी मैं आया\n" +
                "दे दे मुझको पुत्र दान, मैं ऋणी रहूंगा जीवन भर।\n" +
                "और किसी की आश न मुझको, सिर्फ भरोसा है तुम पर\n" +
                "अनुनय-विनय बहुत की उसने, चरणों में धर के शीश।\n" +
                "\n" +
                "तब प्रसन्न होकर बाबा ने, दिया भक्त को यह आशीष\n" +
                "अल्ला भला करेगा तेरा, पुत्र जन्म हो तेरे घर।\n" +
                "कृपा रहे तुम पर उसकी, और तेरे उस बालक पर\n" +
                "अब तक नहीं किसी ने पाया, साँई की कृपा का पार।\n" +
                "पुत्र रतन दे मद्रासी को, धन्य किया उसका संसार\n" +
                "तन-मन से जो भजे उसी का, जग में होता है उद्धार।\n" +
                "\n" +
                "सांच को आंच नहीं है कोई, सदा झूठ की होती हार\n" +
                "मैं हूं सदा सहारे उसके, सदा रहूंगा उसका दास।\n" +
                "साँई जैसा प्रभु मिला है, इतनी की कम है क्या आद\n" +
                "मेरा भी दिन था इक ऎसा, मिलती नहीं मुझे थी रोटी।\n" +
                "तन पर कपड़ा दूर रहा था, शेष रही नन्ही सी लंगोटी\n" +
                "सरिता सन्मुख होने पर भी, मैं प्यासा का प्यासा था।\n" +
                "\n" +
                "दुर्दिन मेरा मेरे ऊपर, दावाग्नि बरसाता था\n" +
                "धरती के अतिरिक्त जगत में, मेरा कुछ अवलम्ब न था।\n" +
                "बिना भिखारी में दुनिया में, दर-दर ठोकर खाता था\n" +
                "ऐसे में इक मित्र मिला जो, परम भक्त साँई का था।\n" +
                "जंजालों से मुक्त, मगर इस, जगती में वह मुझसा था\n" +
                "बाबा के दर्शन के खातिर, मिल दोनों ने किया विचार।\n" +
                "\n" +
                "साँई जैसे दयामूर्ति के दर्शन को हो गए तैयार\n" +
                "पावन शिरडी नगर में जाकर, देखी मतवाली मूर्ति।\n" +
                "धन्य जन्म हो गया कि हमने, दु:ख सारा काफूर हो गया।\n" +
                "संकट सारे मिटे और विपदाओं का अंत हो गया\n" +
                "मान और सम्मान मिला, भिक्षा में हमको बाबा से।\n" +
                "प्रतिबिंबित हो उठे जगत में, हम साँई की आभा से\n" +
                "बाबा ने सम्मान दिया है, मान दिया इस जीवन में।\n" +
                "\n" +
                "इसका ही सम्बल ले, मैं हंसता जाऊंगा जीवन में\n" +
                "साँई की लीला का मेरे, मन पर ऎसा असर हुआ\n" +
                "”काशीराम” बाबा का भक्त, इस शिरडी में रहता था।\n" +
                "मैं साँई का साँई मेरा, वह दुनिया से कहता था\n" +
                "सींकर स्वयं वस्त्र बेचता, ग्राम नगर बाजारों में।\n" +
                "झंकृत उसकी हृदतंत्री थी, साँई की झनकारों में\n" +
                "स्तब्ध निशा थी, थे सोये, रजनी आंचल में चांद सितारे।\n" +
                "\n" +
                "नहीं सूझता रहा हाथ, को हाथ तिमिर के मारे\n" +
                "वस्त्र बेचकर लौट रहा था, हाय! हाट से काशी।\n" +
                "विचित्र बड़ा संयोग कि उस दिन, आता था वह एकाकी\n" +
                "घेर राह में खड़े हो गए, उसे कुटिल अन्यायी।\n" +
                "मारो काटो लूटो इसको, ही ध्वनि पड़ी सुनाई\n" +
                "लूट पीटकर उसे वहां से, कुटिल गये चम्पत हो।\n" +
                "आघातों से मर्माहत हो, उसने दी थी संज्ञा खो\n" +
                "बहुत देर तक पड़ा रहा वह, वहीं उसी हालत में\n" +
                "\n";


        txt.setText(s);
    }
}
